package main

import "fmt"

func main() {
	// var i int
	// var k int
	// for i = 1; i < 10; i++ {
	// 	for k = 1; k < 10; k++ {
	// 		fmt.Printf("%d * %d = %d\n", i, k, i*k)
	// 	}
	// }

	///////////////////////////////////////////////////////////////////

	// for dan :=1 ; dan <=9 ; dan++{
	// 	//5단 건너뛰기
	// 	if dan == 5 {
	// 		continue
	// 	}
	// 	fmt.Printf("%d단\n", dan)

	// 	for j := 1; j <= 9; j++ {
	// 		//각 단마다 *5 건너뛰기
	// 		if j ==5{
	// 			continue
	// 		}
	// 		fmt.Printf("%d*%d = %d\n", dan, j, dan*j)
	// 	}

	// 	fmt.Println()
	// }

	////////////////////////////////////////////////////////////////

	// for dan :=1 ; dan <=9 ; dan++{
	// 	fmt.Printf("%d단\n", dan)

	// 	for j := 1; j <= 9; j++ {
	// 		// 3*2 만 건너뛰기
	// 		if dan ==3 && j == 2{
	// 			continue
	// 		}
	// 		fmt.Printf("%d*%d = %d\n", dan, j, dan*j)
	// 	}

	// 	fmt.Println()
	// }

	////////////////////////////////////////////////////////////////////////

	// *****
	// ****
	// ***
	// **
	// *

	// for i := 0; i < 5; i++ {
	// 	for k := 5; k > i; k-- {
	// 		fmt.Print("*")
	// 	}
	// 	fmt.Println("")
	// }

	// for i := 0; i < 5; i++ {
	// 	for k := 0; k < 5-i; k++ {
	// 		fmt.Print("*")
	// 	}
	// 	fmt.Println("")
	// }

	////////////////////////////////////////////////////////////////////////////

	// *
	// **
	// ***
	// ****
	// *****

	// //줄수
	// for i := 0; i < 5; i++ {
	// 	//별의 갯수
	// 	for k := 0; k <= i; k++ {
	// 		fmt.Print("*")
	// 	}
	// 	fmt.Println("")
	// }

	///////////////////////////////////////////////////////////////////////////////

	// for i := 0; i < 3; i++ {
	// 	for k := 0; k-i <= 0; k++ {
	// 		fmt.Print("*")
	// 	}

	// 	fmt.Println("")
	// }
	// for i := 0; i < 2; i++ {
	// 	for k := 0; k < 2-i; k++ {
	// 		fmt.Print("*")
	// 	}
	// 	fmt.Println("")
	// }

	///////////////////////////////////////////////////////////////////////////

	for i := 0; i < 4; i++ {
		for j := 0; j < 7; j++ {
			fmt.Print("*")
		}
		fmt.Println("")
	}
}