package main

import "fmt"

func main() {
	// a := 4
	// b := 2

	// 비트연산자 : 비트단위연산
	// fmt.Printf("a&b = %v\n",a&b)
	// fmt.Printf("a|b = %v\n",a|b)
	// fmt.Println("a^b =",a^b)

	//fmt.Printf("_",a,b)
	//"_"안의 형식에 맞춰서 a와 b를 위치 시켜라.

	////////////////////////////////////////////////////////////////

	// a := 21
	// c := a%10
	// a = a/10
	// d:= a%10
	// //a 는 정수형 이므로 소수점 탈락.

	// fmt.Printf("첫번째 수 : %v , 두번째 수 : %v\n", c , d)

	/////////////////////////////////////////////////////////////////////////

	// // shift 연산이 곱하기 나누기 연산 보다 빠름 : *2,/2
	// a := 4              // 0100
	// fmt.Println(a << 1) // 1000 : 8
	// fmt.Println(a >> 1) // 0010 : 2

	////////////////////////////////////////////////////////////////////////////////

	// var a bool
	// a = 3 > 4
	// fmt.Print(a)

	/////////////////////////////////////////////////////////////////////////

	// var a bool
	// a = 3 < 4 && 2 < 5

	// fmt.Println(a)

	//////////////////////////////////////////////////////////////////
	// a := 5
	// if a == 3 {
	// 	fmt.Println("a 는 3")
	// } else if a == 4 {
	// 	fmt.Println("a 는 4")
	// } else {
	// 	fmt.Println("a는 3도 아니고, 4도 아니다.")
	// }
	// fmt.Println("a 의 값은 ", a)
	///////////////////////////////////////////////////////////////////
	// a := 5
	// if a == 3 || a == 4 {
	// 	fmt.Println("a 는 3 또는 4 이다")
	// }else{
	// 	fmt.Println("a는 3도 아니고, 4도 아니다.")
	// }
	// fmt.Println("a 의 값은 ", a)
	////////////////////////////////////////////////////////
	a := 5
	if a < 10 && a > 2 {
		fmt.Println("a 는 10보다 작고 2보다 크다")
	}else{
		fmt.Println("a는 10보다 크거나 a는 2보다 작다")
	}
	fmt.Println("a 의 값은 ", a)

}